<template>
  <div class="q-ma-xl text-h3 text-bold text-center col-12">
    발자취
  </div>
  <div class="q-mt-xl col-md-7 col-sm-10 col-xs-12">
    <q-tabs
      v-model="tab"
      inline-label
      class="bg-primary text-white shadow-3"
    >
      <q-tab
        name="sel1990"
        label="1990년대"
      />
      <q-tab
        name="sel2000"
        label="2000년대"
      />
      <q-tab
        name="sel2010"
        label="2010년대"
      />
      <q-tab
        name="sel2020"
        label="2020년대"
      />
    </q-tabs>

    <q-tab-panels
      v-model="tab"
      animated
      class="bg-grey-1"
    >
      <q-tab-panel
        v-for="tabs in history"
        :key="tabs.name"
        :name="tabs.name"
      >
        <div
          v-for="sub in tabs.history"
          :key="sub.date"
          class="row wrap"
        >
          <div
            class="text-h6 col-2"
            style="min-width:120px"
          >
            {{ sub.date }}
          </div>
          <div
            class="self-center col-9 q-pl-md q-pb-md text-h6"
            style="white-space: pre; word-break: break-all; width: ;"
          >
            {{ sub.des }}
          </div>
        </div>
      </q-tab-panel>
    </q-tab-panels>
  </div>
</template>

<script lang="ts">
import { defineComponent, ref } from 'vue'

const history = [
  {
    name: 'sel1990',
    history: [
      { date: '1991-10-27', des: '나눔의교회 창립예배(곽충환 목사와 4가정)\n(장소: 서울시 중구 신당2동 353-24 지하/ 설교: 서정운 목사, 장로회신학대학교 교수)' },
      { date: '1992-03-07', des: '청년부 예배 시작(매주 토요일)' },
      { date: '1992-03-22', des: '첫 재직 임명(14명)' },
      { date: '1992-04-05', des: '아동부 예배 시작. 한영선 교육전도사 부임 (아동부/1996.12.사임)' },
      { date: '1992-04-05', des: '장년부 성가대(중창) 시작' },
      { date: '1992-08-10', des: '전교인 가족수련회(8.10~8.13/을왕리 해수욕장)' },
      { date: '1992-10-25', des: '창립 1주년 감사예배' },
      { date: '1992-10-26', des: '함해노회(제 133회)가입/10.26~10~28' },
      { date: '1993-02-21', des: '남녀 선교회 조직(남2, 여2)' },
      { date: '1993-05-16', des: '전교인 야외예배(영락여신원)\n정규환 교육전도사 부임(청년부/1994.9 사임)' },
      { date: '1993-05-23', des: '12인승 승합차 구입' },
      { date: '1993-07-04', des: '농어촌 교회 및 선교지원 시작' },
      { date: '1993-08-31', des: '제1기 제자훈련 개강' },
      { date: '1993-09-17', des: '다락방 구역모임 시작' },
      { date: '1993-10-11', des: '세이레 새벽기도회 시작(봄, 가을)' },
      { date: '1993-10-31', des: '창립 2주년, 대각성 전도집회(박성규 목사)' },
      { date: '1994-01-02', des: '중고등부 예배 시작(주일 오후 3시, 지도 정규환 전도사)' },
      { date: '1994-04-04', des: '춘계 대심방 시작' },
      { date: '1994-06-27', des: '이슬비 전도편지 시작' },
      { date: '1994-10-02', des: '소선민 교육전도사 부임(청년부/1995.10 사임)' },
      { date: '1994-10-30', des: '창립 3주년, 대각성 전도집회(김만철 윤형주 이재철)' },
      { date: '1994-12-01', des: '최규명 교육전도사 부임(중고등부/ 95.4.21 목사안수/ 95.12 사임)' },
      { date: '1995-01-02', des: '사업체 심방 시작' },
      { date: '1995-01-24', des: '청년부 인도네시아 선교훈련(1.24~2.4)' },
      { date: '1995-10-04', des: '예배당 지하에서 4, 5층으로 이전(4층-교육관, 5층-본당)' },
      { date: '1995-10-29', des: '창립 4주년, 대각성 전도집회(김광한 황수관 기독신우회)' },
      { date: '1995-12-02', des: '김혜중 전도사 부임(전임/ 2009.12. 사임)' },
      { date: '1996-01-04', des: '주일 낮 예배 2부로 드리기 시작' },
      { date: '1996-08-01', des: '노인들에게 용돈 드리기 시작 (11월부터 오후 3시 어르신 예배/현재 오후 1시 30분)' },
      { date: '1996-10-20', des: '제1기 임직식 및 취임식\n장로취임-이형구 신학수, 장로장립-박원환 최만송\n안수집사임직-신용필 노춘식 이욱상 이윤희 곽상환\n권사취임-윤귀례, 권사임직-장덕순 전유순 박희숙' },
      { date: '1996-10-27', des: '창립 5주년, 대각성 전도집회(정삼수 목사)' },
      { date: '1996-12-29', des: '조현수 교육목사 부임(청년부/1997.12.28 사임)' },
      { date: '1997-01-01', des: '위원회 조직(예배, 전도선교, 재정, 교육, 경조, 관리, 새가족, 봉사, 사회, 교회발전 위원회)' },
      { date: '1997-01-05', des: '최상문 교육전도사 부임(아동부, 청년부, 전임/ 2003.11.9 사임)' },
      { date: '1997-04-06', des: '1부 성가대 발족(성가대 2부 조직)' },
      { date: '1997-06-29', des: '성전확장(3층 절반-식당, 목양실, 사무실)' },
      { date: '1997-10-26', des: '창립 6주년, 대각성 전도집회 (정명자 김정택 윤영지-새롭게 하소서)' },
      { date: '1997-11-23', des: '곽충환 목사 위임식' },
      { date: '1998-01-23', des: '청년부 필리핀 선교훈련(1.23~1.30)' },
      { date: '1998-04-01', des: '총회전도학교, 성경파노라마 개강' },
      { date: '1998-07-19', des: '설수철 교육전도사 부임(청년부/ 1999.12 사임)' },
      { date: '1998-07-26', des: '바나바사역 개강' },
      { date: '1998-10-25', des: '창립 7주년, 대각성 전도집회(구봉서 장재윤 이건오)' },
      { date: '1998-12-01', des: '삼천원 산타(현 오천원 산타) 시작' },
      { date: '1999-01-17', des: '성전확장(3층 전체), 15인승 승합차 구입' },
      { date: '1999-08-16', des: '필리핀 삔야한 개척교회 헌당예배(8.16~8.21)' },
      { date: '1999-09-21', des: '함해노회 제147회 서울 시찰회(본 교회)' },
      { date: '1999-10-03', des: '제2기 임직식 및 취임식\n권사취임-오덕남, 권사임직-임기례 박명복 이을남\n안수집사취임-박정복\n안수집사임직-윤윤석 이영빈 김수하 이춘희' },
      { date: '1999-10-31', des: '창립 8주년, 대각성 전도집회(고원용 목사)' }

    ]
  },
  {
    name: 'sel2000',
    history: [
      { date: '2000-01-01', des: '4교구 17지역 17다락방 조직\n성가대 4부로 조직(1부, 2부, 부부, 여선교회)' },
      { date: '2000-01-02', des: '이민홍 교육전도사 부임(아동부/ 2005.1.2 사임)' },
      { date: '2000-05-11', des: '제1회 전교인 체육대회 개최' },
      { date: '2000-09-14', des: '성전확장 공사 시작' },
      { date: '2000-10-29', des: '성전 입당예배' },
      { date: '2000-10-30', des: '창립 9주년, 대각성 전도집회(정도출 목사)' },
      { date: '2000-12-31', des: '4부 예배(주일 오후 1:30/청년부 중심) 시작' },
      { date: '2001-01-01', des: '이준희 교육전도사 부임(중고등부/2001.12.23 사임)' },
      { date: '2001-03-09', des: '제직학교 개강' },
      { date: '2001-09-10', des: '함해노회 제151회 시찰회(이형구 장로 자택)' },
      { date: '2001-10-14', des: '창립 10주년 대각성 전도집회(박수웅 이명박 이종근)' },
      { date: '2001-10-28', des: '창립 10주년 기념행사' },
      { date: '2001-11-04', des: '제3기 임직식\n안수집사임직-김용선, 권사임직-김선자' },
      { date: '2001-12-30', des: '김태형 교육전도사 부임(중고등부/2004.12.12 사임)' },
      { date: '2002-02-27', des: '중보기도학교 개강' },
      { date: '2002-03-16', des: '나눔의 샘터(주부교실) 개강' },
      { date: '2002-05-16', des: '사랑나눔제-남산 필동' },
      { date: '2002-06-26', des: '6호선 약수역 자매결연(지하철 선교회)' },
      { date: '2002-10-26', des: '지하철 문화 행사' },
      { date: '2002-10-27', des: '창립 11주년 행사' },
      { date: '2002-11-20', des: '아버지학교 개강' },
      { date: '2003-04-20', des: '성전건축 작정헌금' },
      { date: '2003-05-01', des: '성전건축 전교인 153기도 시작(2004.8.14 종료)' },
      { date: '2003-06-30', des: '성전부지 매입' },
      { date: '2003-07-07', des: '성전건축 릴레이기도 시작 (7.7~7.27/ 9.15~10.4/ 11.16~12.6)' },
      { date: '2003-08-03', des: '제3회 전교인 수련회(남양주 수동면 수산리 우리마을, 3~5일)' },
      { date: '2003-10-26', des: '창립 12주년' },
      { date: '2003-11-09', des: '제4기 임직식\n장로장립-윤윤석 신용필\n안수집사임직-김하규 유영종 양지열 김영현 양승태 백대기\n권사임직-박순례 이명순 곽두연 김향순 윤옥란 박명자 임인선 장천옥 이일남' },
      { date: '2003-11-23', des: '김신성 교육전도사 부임(아동부/ 2005.12.25 사임)' },
      { date: '2004-02-09', des: '새 성전건축 릴레이기도 시작 (2.9~2.29/ 4.5~4.25/ 6.14~7.4 )' },
      { date: '2004-02-29', des: '새 성전 기공예배' },
      { date: '2004-06-27', des: '성전건축(상량) 감사예배' },
      { date: '2004-08-15', des: '새 성전 예배(전부서 11시 예배/ 8.15~9.5)' },
      { date: '2004-09-05', des: '새 성전 입당예배' },
      { date: '2004-10-10', des: '창립 13주년 대각성 전도집회(최변규 장로/10.10~13)' },
      { date: '2004-10-31', des: '창립13주년' },
      { date: '2004-11-09', des: '이웃초청 전도집회(박수웅 장로, 송정미 사모/11. 9~10)' },
      { date: '2004-12-12', des: '최광진 교육전도사 부임(중고등부/2006.12.31 사임)' },
      { date: '2004-12-18', des: '새 성전(중구 신당2동 353-25) 준공' },
      { date: '2004-12-26', des: '이필창 교육전도사 부임(청년부/ 2005.9.25 사임)' },
      { date: '2005-03-27', des: '이웃초청 전도집회(최화진 교수/ 3.27~28)' },
      { date: '2005-04-05', des: '두 날개 시스템(D12) 시작-제1기 전인적 치유수양회/45명' },
      { date: '2005-05-22', des: '중보기도실 운영 시작' },
      { date: '2005-07-03', des: '<좋은 신문> 발간, 중보기도 특공대 임명' },
      { date: '2005-09-03', des: '제2기 전인적 치유수양회/54명' },
      { date: '2005-09-11', des: '열린모임 시작(4가정)' },
      { date: '2005-10-30', des: '창립 14주년' },
      { date: '2005-12-04', des: '고요한 교육전도사 부임(아동부/ 2007.8.12 사임)' },
      { date: '2005-12-18', des: '권사 은퇴-오덕남 권사' },
      { date: '2005-12-25', des: '백종규 전도사 부임(전임, 청년부, 유치부/ 2009.4.21. 목사안수/ 2010.12.5 사임)' },
      { date: '2006-01-07', des: '제3기 전인적 치유수양회/50명' },
      { date: '2006-02-05', des: '필리핀 단기 선교(2.5~2.11)' },
      { date: '2006-02-15', des: '심야기도회를 금요일에서 수요일로 변경' },
      { date: '2006-04-16', des: '주일찬양예배 시간 변경(오후 5시에서 3시로)\n다락방에서 셀(Cell)로 구역조직 개편' },
      { date: '2006-04-18', des: '160회 함해노회(본 교회/4.18~19) 개최' },
      { date: '2006-05-05', des: '제4기 전인적 치유수양회/43명' },
      { date: '2006-07-23', des: '제1기 세계비전제자대학 졸업/34명' },
      { date: '2006-08-15', des: '강원도 수해지역 근로봉사' },
      { date: '2006-09-02', des: '제5기 전인적 치유수양회/34명' },
      { date: '2006-10-29', des: '창립 15주년, 제5기 임직식\n장로장립-노춘식 이욱상\n안수집사임직-길종진 양영승 설양길 김원석 배성수 정인표 강성모 유호선\n권사임직-김상민 신양희 박현숙 진미숙 강경자' },
      { date: '2006-12-03', des: '제2기 세계비전제자대학 졸업/31명' },
      { date: '2007-01-06', des: '제6기 전인적 치유수양회/31명' },
      { date: '2007-01-07', des: '박상현 교육전도사 부임(중고등부/2008.12.31 사임)' },
      { date: '2007-04-08', des: '제3기 세계비전제자대학 졸업/30명\n필리핀 칼리리산 교회 입당식(4.8~4.13)' },
      { date: '2007-05-05', des: '제7기 전인적 치유수양회/28명' },
      { date: '2007-05-24', des: '전교인 체육대회/동호정보고교' },
      { date: '2007-07-22', des: '제4기 세계비전제자대학 졸업/26명' },
      { date: '2007-08-01', des: '담임목사 안식휴가(8~10월)' },
      { date: '2007-08-19', des: '최병만 교육전도사 부임(아동부/2007.12.23 사임)' },
      { date: '2007-10-28', des: '창립 16주년' },
      { date: '2007-12-02', des: '제5기 세계비전제자대학 졸업/33명' },
      { date: '2007-12-25', des: '박정환 목사 부임(교육부, 아동부, 유치부, 전임/2018.02.25. 사임)' },
      { date: '2007-12-30', des: '권사 은퇴-임기례 곽두연' },
      { date: '2008-01-11', des: '제1회 셀리더수련회(용문 청소년수련관, 11~12일)' },
      { date: '2008-03-01', des: '제8기 전인적 치유수양회/30명' },
      { date: '2008-05-25', des: '제6기 세계비전제자대학 졸업/15명' },
      { date: '2008-09-06', des: '제9기 전인치유수양회/17명' },
      { date: '2008-10-26', des: '창립 17주년' },
      { date: '2008-11-02', des: '개정개역 성경, 새 찬송가 사용' },
      { date: '2008-11-30', des: '제7기 세계비전제자대학 졸업/18명' },
      { date: '2008-12-31', des: '김영현 교육전도사 부임(중고등부/ 2012.12.30 사임)' },
      { date: '2009-01-02', des: '제2회 셀리더수련회(남양주 다윗동산, 2~3일)' },
      { date: '2009-01-10', des: '제10기 전인적 치유수양회/22명' },
      { date: '2009-02-02', des: '일천번제 시작(오직 주님 사랑, 천 날을 하루같이!)' },
      { date: '2009-04-25', des: '제11기 전인적 치유수양회/11명' },
      { date: '2009-06-06', des: '전교인 체육대회/ 청구초등학교' },
      { date: '2009-07-19', des: '제8기 세계비전제자대학 졸업/16명' },
      { date: '2009-09-05', des: '제12기 전인적 치유수양회/12명' },
      { date: '2009-10-25', des: '창립 18주년, 제6기 임직식\n안수집사취임-김성길\n안수집사임직-유영철 조해옥 정종록 김용욱 김영대 이승준 박항경 이철주 김영기\n권사임직-문귀자 차경란 김경희 김기숙 최은순 이경숙 이군자 권희숙 김태환 이상희\n곽충환 목회시집 『인생사계』 출간' },
      { date: '2009-11-29', des: '제9기 세계비전제자대학 졸업/13명' },
      { date: '2009-12-06', des: '김청곤 전도사 부임(청년부, 유치부, 아동부, 전임/ 2010.4.21 목사안수/ 2013.12.29 사임)' }

    ]
  },
  {
    name: 'sel2010',
    history: [
      { date: '2010-01-01', des: '일천번제 제2차년도 (하나님을 기쁘시게, 천 날을 하루같이!)' },
      { date: '2010-01-03', des: '박정희 전도사 부임(심방, 전도/2011.1.2 사임)' },
      { date: '2010-01-08', des: '제3회 셀리더수련회(오색 그린야드콘도, 8~9일)' },
      { date: '2010-01-16', des: '제13기 전인적 치유수양회/16명' },
      { date: '2010-02-05', des: '(구립) 남산타운어린이집 위탁운영 결정' },
      { date: '2010-04-01', des: '제10기 세계비전제자대학 졸업/16명' },
      { date: '2010-05-01', des: '제14기 전인적 치유수양회/13명' },
      { date: '2010-06-14', des: '특별새벽기도회(일천번제 500일 반환점, 14~16일)' },
      { date: '2010-07-25', des: '제11기 세계비전제자대학 졸업/8명' },
      { date: '2010-09-04', des: '제15기 전인적 치유수양회/13명' },
      { date: '2010-10-19', des: '곽충환 목사 함해노회장 취임' },
      { date: '2010-10-31', des: '창립 19주년(주제: 하나님나라 겨자씨운동 19년)' },
      { date: '2010-12-05', des: '송재찬 목사 부임(청년부, 전임 / 2015.10.15. 사임)' },
      { date: '2010-12-26', des: '장로은퇴-이욱상, 권사은퇴-이일남' },
      { date: '2011-01-01', des: '일천번제 제3차년도 (천 날을 하루같이, 다음세대를 향하여!)' },
      { date: '2011-01-02', des: '변종숙 전도사 부임(심방, 전도/ 2015.4.5 사임)' },
      { date: '2011-01-08', des: '제16기 전인적 치유수양회/16명' },
      { date: '2011-01-14', des: '제4회 셀리더수련회(오색 그린야드콘도, 14~15일)' },
      { date: '2011-01-26', des: '창립 20주년 기념행사 위원회 구성' },
      { date: '2011-02-19', des: '(구립) 남산타운어린이집 졸업식(제1회)' },
      { date: '2011-03-06', des: '창립 20주년기념 전교인 성경필사 시작' },
      { date: '2011-03-26', des: '청년부 새생명축제(Love Festival)' },
      { date: '2011-04-03', des: '제13기 세계비전제자대학 졸업/13명' },
      { date: '2011-04-17', des: '버티성서대학 개강 (성경파노라마, 욥기산책, 계시록과 종말, 숨겨진 성경이야기)' },
      { date: '2011-04-18', des: '창립 20주년기념 전교인 1천 시간 기도대행진(18~23일)' },
      { date: '2011-05-07', des: '제17기 전인적 치유수양회/18명' },
      { date: '2011-05-22', des: '나눔 북카페(Book Cafe) 오픈' },
      { date: '2011-07-24', des: '제14기 세계비전제자대학 졸업/9명' },
      { date: '2011-07-31', des: '창립 20주년기념 제4회 전교인수련회 (가평 용두암청소년수련원, 7.31~8.2)' },
      { date: '2011-09-17', des: '제18기 전인적 치유수양회/18명' },
      { date: '2011-09-25', des: '버티성서대학 개강 (요나서산책, 계시록과 종말, 죽기살기로 성경읽기)' },
      { date: '2011-10-23', des: '창립 20주년, 제7기 임직식\n장로장립-김용선\n안수집사임직-이창우 백성화 조한상 나영근 박기재 최성국 최기붕\n권사임직-전옥희 변옥경 강순선 정연숙 김명화 김영혜 김선순 강경화 옥석련 최청자' },
      { date: '2011-10-30', des: '창립 20주년기념 행사 (주제: 스무 살 나눔, 아름다운 비상을 꿈꾸다/ 10.31~11.5)\n감사예배 및 축하예식 (일천번제 종료, 전교인 필사성경 봉정, 특별표창, 비전선포)\n헌당감사예배 및 은퇴식 (장로은퇴-박원환 최만송 신용필, 권사은퇴-강경자)\n특별새벽기도회(주제: 새로운 20년을 향하여/ 10.31~11.5)' },
      { date: '2011-11-13', des: '스마트폰 나눔의교회 App(어플리케이션) 제작' },
      { date: '2011-12-04', des: '제15기 세계비전제자대학 졸업/6명' },
      { date: '2011-12-08', des: '함해노회 100주년기념 예배 참석(장로회신학대학교)' },
      { date: '2012-01-07', des: '제5회 셀리더수련회(한강교회, 함해노회소속 교회연합)' },
      { date: '2012-01-14', des: '제19기 전인적 치유수양회/4명' },
      { date: '2012-02-18', des: '(구립) 남산타운어린이집 졸업식(제2회)' },
      { date: '2012-04-01', des: '제16기 세계비전제자대학 졸업/9명' },
      { date: '2012-04-22', des: '버티성서대학 개강(욥기산책, 타문화권 선교, 소요리문답)' },
      { date: '2012-04-28', des: '제20기 전인적 치유수양회/13명' },
      { date: '2012-05-21', des: '심령대부흥회(강사: 임만재 목사/21~23일)' },
      { date: '2012-05-28', des: '전교인 체육대회(청구초등학교)' },
      { date: '2012-07-22', des: '제17기 세계비전제자대학 졸업/7명' },
      { date: '2012-09-01', des: '제21기 전인적 치유수양회/18명' },
      { date: '2012-10-08', des: '세이레 특별새벽기도회(신약통독/8~23일)' },
      { date: '2012-10-14', des: '버티성서대학 개강 (한국교회사인물산책, 로마서강해, 소요리문답2)' },
      { date: '2012-10-28', des: '창립21주년, 나눔찬양제(청년부 주관)' },
      { date: '2012-11-25', des: '제18기 세계비전제자대학 졸업/7명' },
      { date: '2012-12-30', des: '홍대표 교육전도사 부임(중고등부/2014.12.31 사임)\n협동장로은퇴-한계환, 권사은퇴-문귀자 김태환 최청자' },
      { date: '2013-01-05', des: '제22기 전인적 치유수양회/14명' },
      { date: '2013-02-23', des: '(구립) 남산타운어린이집 졸업식(제3회)' },
      { date: '2013-03-11', des: '세이레 특별새벽기도회(사순절, 11~31일)' },
      { date: '2013-04-07', des: '제19기 세계비전제자대학 졸업/4명' },
      { date: '2013-04-21', des: '버티성서대학 (사도행전산책, 로마서강해, 소요리문답-교리편)' },
      { date: '2013-05-04', des: '제23기 전인적 치유수양회/14명' },
      { date: '2013-05-25', des: '아버지학교(부라보스쿨 5주간) 개강' },
      { date: '2013-07-01', des: '러시아 단기선교(청년부, 1~8일)' },
      { date: '2013-07-21', des: '제20기 세계비전제자대학 졸업/7명' },
      { date: '2013-09-07', des: '제24기 전인적 치유수양회/17명' },
      { date: '2013-09-29', des: '악기교실(통기타, 베이스기타, 드럼) 개강' },
      { date: '2013-10-06', des: '버티성서대학 개강 (주기도문강해, 에베소서강해, 소요리문답-실천편)' },
      { date: '2013-10-27', des: '창립 22주년' },
      { date: '2013-12-01', des: '제21기 세계비전제자대학 졸업/7명' },
      { date: '2014-01-04', des: '제25기 전인적 치유수양회/17명' },
      { date: '2014-01-05', des: '정영만 목사 부임(아동부, 전임/2015.12.27 사임)' },
      { date: '2014-02-22', des: '(구립) 남산타운어린이집 졸업식(제4회)' },
      { date: '2014-03-16', des: '제22기 세계비전제자대학 졸업/ 4명' },
      { date: '2014-03-17', des: '세이레 특별새벽기도회(3. 17 ~ 4. 6)' },
      { date: '2014-04-20', des: '버티성서대학 개강 (성경탐구-구약1, 예수1, 풍성한 생명)' },
      { date: '2014-04-26', des: '제26기 전인적치유수양회/ 8명' },
      { date: '2014-07-20', des: '제23기 세계비전제자대학 졸업/ 5명' },
      { date: '2014-08-19', des: 'CTS “내가 매일 기쁘게” 나눔의교회 출연 방송' },
      { date: '2014-08-31', des: '가을10주 행복모임 시작 기도대행진(77일, 9. 15 ~ 11. 30)' },
      { date: '2014-09-15', des: '버티성서대학 개강 (성경탐구-구약2, 예수2, 기도)' },
      { date: '2014-10-12', des: '창립 23주년, 제8기 임직식\n장로장립 – 곽상환\n안수집사취임 - 이영순\n안수집사임직 – 정봉량 김 철 구규복 이 환 김남현 최병규 박한식 옥치오\n권사취임 – 임금옥 유경주 김영단\n권사임직 – 신성자 서정해 전인순 정기순 변양녀 정태임 문삼순' },
      { date: '2014-10-26', des: '서승숙 박현정 김기경' },
      { date: '2014-11-10', des: '세이레 특별새벽기도회(10~30일)' },
      { date: '2014-11-16', des: '남선교회, 여전도회 재편성(남자: 30,41,47,51,57,66선교회 / 여자: 30,36,41,46,51,54,57,62,67,75전도회)' },
      { date: '2014-11-30', des: '제24기 세계비전제자대학 졸업/ 6명' },
      { date: '2014-12-18', des: '다산동 교동협의회 연합당회(장소:신당중앙교회)' },
      { date: '2014-12-25', des: '찾아가서 드리는 성탄예배(전교인 20교회 방문)' },
      { date: '2014-12-31', des: '김영광 교육전도사 부임(중고등부/2017.11.16 사임)' },
      { date: '2015-01-09', des: '제6회 셀리더수련회(가평 상수리나무팬션, 9~10일)' },
      { date: '2015-02-14', des: '(구립) 남산타운어린이집 졸업식(제5회)' },
      { date: '2015-04-04', des: '시즌2 제1기 회복캠프(27기 전치유)/ 16명' },
      { date: '2015-04-05', des: '봄10주 행복모임 시작\n버티성서대학 개강' },
      { date: '2015-04-09', des: '제1기 나눔 아기학교(4.9 ~ 6.11)' },
      { date: '2015-04-19', des: '제25기 세계비전제자대학 졸업/ 5명' },
      { date: '2015-05-25', des: '세이레 특별새벽기도회(5.25~6.14)' },
      { date: '2015-06-14', des: '나눔의교회23년사 『무지개 방앗간의 합창』 발간 감사예배' },
      { date: '2015-08-02', des: '제26기 세계비전제자대학 졸업/ 4명' },
      { date: '2015-09-06', des: '나눔의교회 항존직 선거규정 제정' },
      { date: '2015-09-12', des: '시즌2 제2기 회복캠프(28기 전치유)/ 6명' },
      { date: '2015-09-13', des: '가을10주 행복모임 시작' },
      { date: '2015-09-24', des: '제2기 나눔 아기학교(9.24 ~11.26)' },
      { date: '2015-10-08', des: '버티성서대학 개강' },
      { date: '2015-10-16', des: '다산동 교동협의회 효도관광(오두산 통일전망대)' },
      { date: '2015-10-25', des: '창립 24주년' },
      { date: '2015-11-08', des: '안성우 전도사 부임(전임, 아동부/ 2016.4.19. 목사안수 /2018.12.16 사임)' },
      { date: '2015-11-23', des: '특별 세이레새벽기도회(11.23 ~ 1.13)' },
      { date: '2015-11-29', des: '대강절 오천원산타 섬김' },
      { date: '2015-12-31', des: '오택승 목사 부임(청년부, 전임/2020.8.30. 사임)\n협동 교역자 부임(정정 목사, 변종숙 전도사)' },
      { date: '2016-01-03', des: '교회학교 영아부 신설\n문정화 교육전도사 부임(영아부)\n김효중 교육전도사 부임(유치부)' },
      { date: '2016-01-08', des: '제7회 셀리더수련회(가평 상수리나무팬션, 8~9일)' },
      { date: '2016-02-10', des: '사순절 북한아동 식량지원 동전모으기(2월10일~3월27일)' },
      { date: '2016-02-20', des: '(구립) 남산타운 어린이집 졸업식(제6회)' },
      { date: '2016-03-13', des: '시즌2 제3기 회복캠프(29기 전치유)' },
      { date: '2016-03-14', des: '봄10주 행복모임 시작\n세이레 특별새벽기도회(3월14일~4월3일)' },
      { date: '2016-04-03', des: '제9기 항존직 선출을 위한 공동의회(4월3일, 10일)' },
      { date: '2016-04-07', des: '버티성서대학 개강' },
      { date: '2016-04-09', des: '제3기 나눔아기학교(4월9일~6월18일)' },
      { date: '2016-05-09', des: '성령강림절맞이 특별새벽기도회(김귀환 선교사, 9~14일)' },
      { date: '2016-05-22', des: '다산동 교회연합 예술제 개최' },
      { date: '2016-06-06', des: '필리핀선교지 방문 (필리핀 깔리니산교회와 삔야한교회 재건축현장, 17명)' },
      { date: '2016-07-31', des: '창립25주년기념 제5회 전교인수련회 (가평 광성교회 수련원, 7월31일~8월2일)' },
      { date: '2016-09-03', des: '중고등부 ‘푸른이의 밤\n제4기 나눔아기학교(9월3일~11월26일)' },
      { date: '2016-09-10', des: '시즌2 제4기 회복캠프(30기 전치유)' },
      { date: '2016-09-11', des: '가을10주 행복모임 시작\n개안수술환우 돕기 바자회(연합여전도회)' },
      { date: '2016-10-02', des: '버티성서대학 개강' },
      { date: '2016-10-10', des: '세이레 특별새벽기도회(10월10~30일)' },
      { date: '2016-10-30', des: '창립25주년, 제9기 임직식\n안수집사임직 - 김양규 탁성덕 김창남 김용성 백승인\n권사임직 - 김진희 김은숙 조칠남 최진영 김진옥 이유미 신미연' },
      { date: '2016-11-12', des: '교회학교 교사세미나' },
      { date: '2016-11-27', des: '대강절 오천원산타 섬김' },
      { date: '2016-12-06', des: '시즌2 세계비전제자대학 제1기 졸업/10명' },
      { date: '2017-01-06', des: '제8회 셀리더수련회(강화 성산예수마을, 6~7일)' },
      { date: '2017-02-18', des: '(구립) 남산타운 어린이집 졸업식(제7회)' },
      { date: '2017-02-19', des: '캄보디아 비전트립(프놈펜 Bright Voice Church, 17명)' },
      { date: '2017-03-18', des: '시즌2 제5기 회복캠프(31기 전치유)' },
      { date: '2017-03-19', des: '봄 10주 행복모임 시작' },
      { date: '2017-03-25', des: '제5기 나눔아기학교(3월25일~6월3일)' },
      { date: '2017-03-27', des: '세이레 특별새벽기도회(3월27일~4월16일)' },
      { date: '2017-04-02', des: '버티성서대학 개강' },
      { date: '2017-07-10', des: '러시아선교지 방문(7월10~15일) (우수리스크, 23명)' },
      { date: '2017-09-09', des: '시즌2 제6기 회복캠프(32기 전치유)' },
      { date: '2017-09-17', des: '가을 10주 행복모임 시작' },
      { date: '2017-09-16', des: '제6기 나눔아기학교(9월16일~12월2일)' },
      { date: '2017-09-17', des: '버티성서대학 개강' },
      { date: '2017-10-21', des: '교회학교 교사세미나' },
      { date: '2017-10-29', des: '창립26주년 기념예배' },
      { date: '2017-11-18', des: '중고등부 ‘푸른이의 밤’' },
      { date: '2017-12-03', des: '대강절 오천원산타 섬김' },
      { date: '2017-12-31', des: '시즌2 세계비전제자대학 제2기 졸업/6명' },
      { date: '2018-01-05', des: '제9회 셀리더수련회(강화 성산예수마을, 5~6일)' },
      { date: '2018-01-14', des: '캄보디아선교지 방문(1월14~20일) (프놈펜 명성선교센타, 20명)' },
      { date: '2018-02-24', des: '(구립) 남산타운 어린이집 졸업식(제8회)' },
      { date: '2018-03-10', des: '시즌2 제7기 회복캠프(33기 전치유)' },
      { date: '2018-03-11', des: '제10기 항존직 선출을 위한 공동의회(3월11일, 17일)' },
      { date: '2018-03-12', des: '세이레 특별새벽기도회(3월12일~4월1일)' },
      { date: '2018-03-17', des: '제7기 나눔아기학교(3월17일~6월9일)' },
      { date: '2018-03-25', des: '봄 10주 행복모임 시작' },
      { date: '2018-04-08', des: '버티성서대학 개강' },
      { date: '2018-06-24', des: '몽골선교지 방문(6월24~30일) (울란바토르, 15명)' },
      { date: '2018-09-08', des: '시즌2 제8기 회복캠프(34기 전치유)' },
      { date: '2018-09-15', des: '제8기 나눔아기학교(9월15일~11월24일)' },
      { date: '2018-09-16', des: '가을 10주 행복모임 시작' },
      { date: '2018-09-18', des: '버티성서대학 개강' },
      { date: '2018-10-08', des: '세이레 특별새벽기도회(10월8~28일)' },
      { date: '2018-10-20', des: '교회학교 교사세미나' },
      { date: '2018-10-28', des: '창립27주년 기념예배, 제10기 임직식\n장로임직-설양길 유영종\n안수집사임직-최종범 김용창 정성진 노재훈 김종헌 문영철\n권사임직-황정혜 오상순 박양숙 조숙자 홍은숙 방명신 박연숙 이병숙 권삼순' },
      { date: '2018-11-17', des: '중고등부 ‘푸른이의 밤’' },
      { date: '2018-11-26', des: '일본 순교지 순례(11월26~30일)' },
      { date: '2018-12-02', des: '대강절 오천원산타 섬김' },
      { date: '2018-12-16', des: '김종원 목사 부임(청년부, 전임/2021.3.28. 사임)' },
      { date: '2018-12-30', des: '정혜연 전도사 부임(유치부, 교육)\n시즌2 세계비전제자대학 제3기 졸업/5명' },
      { date: '2019-01-01', des: '3년(30주년) 동안 성전건축 헌금 봉헌' },
      { date: '2019-01-02', des: '심령대부흥회(강사:박희종목사/대봉교회, 1월2~4일)' },
      { date: '2019-01-11', des: '제10회 셀리더수련회(양주 예닮원, 1월11~12일)' },
      { date: '2019-02-24', des: '(구립) 남산타운 어린이집 졸업식(제9회)' },
      { date: '2019-03-09', des: '시즌2 제9기 회복캠프(35기 전치유)' },
      { date: '2019-03-11', des: '성지순례(이스라엘, 요르단, 터키, 3월11~22일)' },
      { date: '2019-03-16', des: '제9기 나눔아기학교(3월16일~6월1일)' },
      { date: '2019-03-24', des: '봄 10주 행복모임 시작' },
      { date: '2019-04-01', des: '세이레 특별새벽기도회(4월1일~4월21일)' },
      { date: '2019-04-10', des: '버티성서대학 개강' },
      { date: '2019-04-24', des: '수요 낮 예배 신설' },
      { date: '2019-07-29', des: '중고등부 필리핀선교(7월29일~8월3일) (민도르섬 칼라판시, 51명)' },
      { date: '2019-08-31', des: '시즌2 제10기 회복캠프(36기 전치유)' },
      { date: '2019-09-15', des: '가을 10주 행복모임 시작' },
      { date: '2019-09-17', des: '버티성서대학 개강' },
      { date: '2019-09-15', des: '제9기 나눔아기학교(10월5일~12월7일)' },
      { date: '2019-10-07', des: '세이레 특별새벽기도회(10월7~27일)' },
      { date: '2019-10-26', des: '교회학교 교사세미나' },
      { date: '2019-10-27', des: '창립28주년 기념예배' },
      { date: '2019-11-16', des: '중고등부 ‘푸른이의 밤’' },
      { date: '2019-12-01', des: '대강절 오천원산타 섬김' },
      { date: '2019-12-29', des: '시즌2 세계비전제자대학 제4기 졸업/4명' }

    ]
  },
  {
    name: 'sel2020',
    history: [
      { date: '2020-01-05', des: '기드온 300 기도 동역자 시작' },
      { date: '2020-01-11', des: '제11회 셀리더수련회(나눔의교회)' },
      { date: '2020-02-03', des: '대만선교(2월3일~8일)' },
      { date: '2020-06-01', des: '봄 세이레 특별새벽기도회(6월1~21일)' },
      { date: '2020-08-09', des: '송경미 전도사 부임(영아부, 교육)' },
      { date: '2020-09-06', des: '유귀귀 목사 부임(아동부, 전임)' },
      { date: '2020-10-12', des: '세이레 특별새벽기도회(10월12일~11월1일)' },
      { date: '2020-10-25', des: '창립29주년 기념예배' },
      { date: '2020-11-22', des: '담임목사 안식휴가(20년12월~21년2월)' },
      { date: '2020-12-01', des: '대강절 오천원산타 섬김' },
      { date: '2021-01-03', des: '권사은퇴-장덕순,임인선,장천옥,박현숙,최은순' },
      { date: '2021-03-15', des: '세이레 특별새벽기도회(사순절,3월15일~4월4일)' },
      { date: '2021-03-28', des: '김상욱 목사 부임(청년부, 전임)' },
      { date: '2021-08-01', des: '창립 30주년기념 성경사랑하기 13주' },
      { date: '2021-10-11', des: '가을 세이레 새벽기도회(10월 11일~10월 31일)' },
      { date: '2021-10-31', des: '창립30주년 기념예배' },
      { date: '2021-12-05', des: '대강절 오천원산타 섬김' },
      { date: '2021-12-24', des: '창립 30주년 전교인 성경필사' },
      { date: '2022-01-02', des: '권사은퇴- 김영단' },
      { date: '2022-01-03', des: '신년 특별 새벽 기도회(1월 3일~1월 8일)' }

    ]
  }
]

export default defineComponent({
  name: 'HistoryPage',
  components: {

  },
  setup () {
    return {
      tab: ref('sel1990'),
      history
    }
  },
  data () {
    return {
    }
  }
})
</script>
